In [1]:
import pandas as pd

In [8]:
purchase_1 = pd.Series({'Name':'Chris','Item':'DogFood','Cost':22.50})

In [15]:
purchase_2 = pd.Series({'Name':'Michel','Item':'CatMilk','Cost':15.75})

In [10]:
purchase_3 = pd.Series({'Name':'Tim','Item':'Bread','Cost':8.65})

In [5]:
pd.DataFrame?

In [16]:
df=pd.DataFrame([purchase_1,purchase_2,purchase_3],index=['Store1','Store2','Store3'])

In [17]:
df

         Cost     Item    Name
Store1  22.50  DogFood   Chris
Store2  15.75  CatMilk  Michel
Store3   8.65    Bread     Tim

In [18]:
df.head()

         Cost     Item    Name
Store1  22.50  DogFood   Chris
Store2  15.75  CatMilk  Michel
Store3   8.65    Bread     Tim

In [19]:
df.loc['Store2']

Cost      15.75
Item    CatMilk
Name     Michel
Name: Store2, dtype: object

In [20]:
df.loc['Store1']

Cost       22.5
Item    DogFood
Name      Chris
Name: Store1, dtype: object

In [21]:
df.loc['Store1','Cost']

22.5

In [22]:
df.T

       Store1   Store2 Store3
Cost     22.5    15.75   8.65
Item  DogFood  CatMilk  Bread
Name    Chris   Michel    Tim

In [23]:
df.T

       Store1   Store2 Store3
Cost     22.5    15.75   8.65
Item  DogFood  CatMilk  Bread
Name    Chris   Michel    Tim

In [27]:
df['Cost']

Store1    22.50
Store2    15.75
Store3     8.65
Name: Cost, dtype: float64

In [28]:
df.loc['Store1']['Cost']

22.5

In [30]:
df.loc[:,['Name','Cost']]

          Name   Cost
Store1   Chris  22.50
Store2  Michel  15.75
Store3     Tim   8.65

In [31]:
df.drop('Store2')

         Cost     Item   Name
Store1  22.50  DogFood  Chris
Store3   8.65    Bread    Tim

In [32]:
copy_df=df.copy()

In [33]:
copy_df

         Cost     Item    Name
Store1  22.50  DogFood   Chris
Store2  15.75  CatMilk  Michel
Store3   8.65    Bread     Tim

In [34]:
df['Location']=None

In [35]:
df

         Cost     Item    Name Location
Store1  22.50  DogFood   Chris     None
Store2  15.75  CatMilk  Michel     None
Store3   8.65    Bread     Tim     None

In [36]:
del df['Location']

In [37]:
df

         Cost     Item    Name
Store1  22.50  DogFood   Chris
Store2  15.75  CatMilk  Michel
Store3   8.65    Bread     Tim

In [38]:
df['Cost']+2

Store1    24.50
Store2    17.75
Store3    10.65
Name: Cost, dtype: float64